
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Тут будет условное оформление
	
	УсловноеОформлениеМассив = Параметры.СтруктураЦвета;
	Счетчик = 0;     
	Для каждого Цвет Из УсловноеОформлениеМассив Цикл
		Счетчик = Счетчик+1;
		Строка = Оформление.Добавить();
		Строка.Цвет = Счетчик;     
		Строка.Представление = Цвет[0];
		//Добавлется элемент и поле
		ЭлементУсловногоОформленияКД = ОбщегоНазначенияБЗК.ДобавитьУсловноеОформление(ЭтаФорма,"ОформлениеПредставление");
		
		//Отбор Условноего оформления
		ОтборУсловногоОформления = ОбщегоНазначенияБЗК.ДобавитьОтборУсловногоОформления(ЭлементУсловногоОформленияКД,"Оформление.Цвет","=",Счетчик);
		
		ЭлементУсловногоОформленияКД.Оформление.УстановитьЗначениеПараметра("ЦветФона", Цвет[1]);

	КонецЦикла;

КонецПроцедуры
